Joghaimi/PMM/custom_Board/1.8.13/boards.txt
# PMM0630 (Native USB Port)
# --------------------------------------
PMM0630.name=PMM0630 (Native USB Port)
PMM0630.vid.0=0x2341
PMM0630.pid.0=0x804d
PMM0630.vid.1=0x2341
PMM0630.pid.1=0x004d
PMM0630.vid.2=0x2341
PMM0630.pid.2=0x824d
PMM0630.vid.3=0x2341
PMM0630.pid.3=0x024d
PMM0630.upload_port.0.vid=0x2341
PMM0630.upload_port.0.pid=0x804d
PMM0630.upload_port.1.vid=0x2341
PMM0630.upload_port.1.pid=0x004d
PMM0630.upload_port.2.vid=0x2341
PMM0630.upload_port.2.pid=0x824d
PMM0630.upload_port.3.vid=0x2341
PMM0630.upload_port.3.pid=0x024d
PMM0630.upload_port.4.board=arduino_zero_native
PMM0630.build.usb_product="PMM0630"
PMM0630.upload.tool=bossac
PMM0630.upload.tool.default=bossac
PMM0630.upload.tool.network=arduino_ota
PMM0630.upload.protocol=sam-ba
PMM0630.upload.maximum_size=262144
PMM0630.upload.maximum_data_size=32768
PMM0630.upload.use_1200bps_touch=true
PMM0630.upload.wait_for_upload_port=true
PMM0630.upload.native_usb=true
PMM0630.build.mcu=cortex-m0plus
PMM0630.build.f_cpu=48000000L
PMM0630.build.usb_product="pmm0630"
PMM0630.build.usb_manufacturer="PMM LLC"
PMM0630.build.board=pmm0630
PMM0630.build.core=arduino
PMM0630.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0630.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0630.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0630.build.variant=pmm0630
PMM0630.build.variant_system_lib=
PMM0630.build.vid=0x2341
PMM0630.build.pid=0x804d
PMM0630.bootloader.tool=openocd
PMM0630.bootloader.tool.default=openocd
PMM0630.bootloader.file=zero/samd21_sam_ba.bin


# PMM0631 (Native USB Port)
# --------------------------------------
PMM0631.name=PMM0631 (Native USB Port)
PMM0631.vid.0=0x2341
PMM0631.pid.0=0x804d
PMM0631.vid.1=0x2341
PMM0631.pid.1=0x004d
PMM0631.vid.2=0x2341
PMM0631.pid.2=0x824d
PMM0631.vid.3=0x2341
PMM0631.pid.3=0x024d
PMM0631.upload_port.0.vid=0x2341
PMM0631.upload_port.0.pid=0x804d
PMM0631.upload_port.1.vid=0x2341
PMM0631.upload_port.1.pid=0x004d
PMM0631.upload_port.2.vid=0x2341
PMM0631.upload_port.2.pid=0x824d
PMM0631.upload_port.3.vid=0x2341
PMM0631.upload_port.3.pid=0x024d
PMM0631.upload_port.4.board=arduino_zero_native
PMM0631.build.usb_product="PMM0631"
PMM0631.upload.tool=bossac
PMM0631.upload.tool.default=bossac
PMM0631.upload.tool.network=arduino_ota
PMM0631.upload.protocol=sam-ba
PMM0631.upload.maximum_size=262144
PMM0631.upload.maximum_data_size=32768
PMM0631.upload.use_1200bps_touch=true
PMM0631.upload.wait_for_upload_port=true
PMM0631.upload.native_usb=true
PMM0631.build.mcu=cortex-m0plus
PMM0631.build.f_cpu=48000000L
PMM0631.build.usb_product="pmm0631"
PMM0631.build.usb_manufacturer="PMM LLC"
PMM0631.build.board=pmm0631
PMM0631.build.core=arduino
PMM0631.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0631.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0631.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0631.build.variant=pmm0631
PMM0631.build.variant_system_lib=
PMM0631.build.vid=0x2341
PMM0631.build.pid=0x804d
PMM0631.bootloader.tool=openocd
PMM0631.bootloader.tool.default=openocd
PMM0631.bootloader.file=zero/samd21_sam_ba.bin


# PMM0635 (Native USB Port)
# --------------------------------------
PMM0635.name=PMM0635 (Native USB Port)
PMM0635.vid.0=0x2341
PMM0635.pid.0=0x804d
PMM0635.vid.1=0x2341
PMM0635.pid.1=0x004d
PMM0635.vid.2=0x2341
PMM0635.pid.2=0x824d
PMM0635.vid.3=0x2341
PMM0635.pid.3=0x024d
PMM0635.upload_port.0.vid=0x2341
PMM0635.upload_port.0.pid=0x804d
PMM0635.upload_port.1.vid=0x2341
PMM0635.upload_port.1.pid=0x004d
PMM0635.upload_port.2.vid=0x2341
PMM0635.upload_port.2.pid=0x824d
PMM0635.upload_port.3.vid=0x2341
PMM0635.upload_port.3.pid=0x024d
PMM0635.upload_port.4.board=arduino_zero_native
PMM0635.build.usb_product="PMM0635"
PMM0635.upload.tool=bossac
PMM0635.upload.tool.default=bossac
PMM0635.upload.tool.network=arduino_ota
PMM0635.upload.protocol=sam-ba
PMM0635.upload.maximum_size=262144
PMM0635.upload.maximum_data_size=32768
PMM0635.upload.use_1200bps_touch=true
PMM0635.upload.wait_for_upload_port=true
PMM0635.upload.native_usb=true
PMM0635.build.mcu=cortex-m0plus
PMM0635.build.f_cpu=48000000L
PMM0635.build.usb_product="pmm0635"
PMM0635.build.usb_manufacturer="PMM LLC"
PMM0635.build.board=pmm0635
PMM0635.build.core=arduino
PMM0635.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0635.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0635.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0635.build.variant=pmm0635
PMM0635.build.variant_system_lib=
PMM0635.build.vid=0x2341
PMM0635.build.pid=0x804d
PMM0635.bootloader.tool=openocd
PMM0635.bootloader.tool.default=openocd
PMM0635.bootloader.file=zero/samd21_sam_ba.bin


# PMM0636 (Native USB Port)
# --------------------------------------
PMM0636.name=PMM0636 (Native USB Port)
PMM0636.vid.0=0x2341
PMM0636.pid.0=0x804d
PMM0636.vid.1=0x2341
PMM0636.pid.1=0x004d
PMM0636.vid.2=0x2341
PMM0636.pid.2=0x824d
PMM0636.vid.3=0x2341
PMM0636.pid.3=0x024d
PMM0636.upload_port.0.vid=0x2341
PMM0636.upload_port.0.pid=0x804d
PMM0636.upload_port.1.vid=0x2341
PMM0636.upload_port.1.pid=0x004d
PMM0636.upload_port.2.vid=0x2341
PMM0636.upload_port.2.pid=0x824d
PMM0636.upload_port.3.vid=0x2341
PMM0636.upload_port.3.pid=0x024d
PMM0636.upload_port.4.board=arduino_zero_native
PMM0636.build.usb_product="PMM0636"
PMM0636.upload.tool=bossac
PMM0636.upload.tool.default=bossac
PMM0636.upload.tool.network=arduino_ota
PMM0636.upload.protocol=sam-ba
PMM0636.upload.maximum_size=262144
PMM0636.upload.maximum_data_size=32768
PMM0636.upload.use_1200bps_touch=true
PMM0636.upload.wait_for_upload_port=true
PMM0636.upload.native_usb=true
PMM0636.build.mcu=cortex-m0plus
PMM0636.build.f_cpu=48000000L
PMM0636.build.usb_product="pmm0636"
PMM0636.build.usb_manufacturer="PMM LLC"
PMM0636.build.board=pmm0636
PMM0636.build.core=arduino
PMM0636.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0636.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0636.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0636.build.variant=pmm0636
PMM0636.build.variant_system_lib=
PMM0636.build.vid=0x2341
PMM0636.build.pid=0x804d
PMM0636.bootloader.tool=openocd
PMM0636.bootloader.tool.default=openocd
PMM0636.bootloader.file=zero/samd21_sam_ba.bin


# PMM0638 (Native USB Port)
# --------------------------------------
PMM0638.name=PMM0638 (Native USB Port)
PMM0638.vid.0=0x2341
PMM0638.pid.0=0x804d
PMM0638.vid.1=0x2341
PMM0638.pid.1=0x004d
PMM0638.vid.2=0x2341
PMM0638.pid.2=0x824d
PMM0638.vid.3=0x2341
PMM0638.pid.3=0x024d
PMM0638.upload_port.0.vid=0x2341
PMM0638.upload_port.0.pid=0x804d
PMM0638.upload_port.1.vid=0x2341
PMM0638.upload_port.1.pid=0x004d
PMM0638.upload_port.2.vid=0x2341
PMM0638.upload_port.2.pid=0x824d
PMM0638.upload_port.3.vid=0x2341
PMM0638.upload_port.3.pid=0x024d
PMM0638.upload_port.4.board=arduino_zero_native
PMM0638.build.usb_product="PMM0638"
PMM0638.upload.tool=bossac
PMM0638.upload.tool.default=bossac
PMM0638.upload.tool.network=arduino_ota
PMM0638.upload.protocol=sam-ba
PMM0638.upload.maximum_size=262144
PMM0638.upload.maximum_data_size=32768
PMM0638.upload.use_1200bps_touch=true
PMM0638.upload.wait_for_upload_port=true
PMM0638.upload.native_usb=true
PMM0638.build.mcu=cortex-m0plus
PMM0638build.f_cpu=48000000L
PMM06308.build.usb_product="pmm0638"
PMM0638.build.usb_manufacturer="PMM LLC"
PMM0638.build.board=pmm0638
PMM0638.build.core=arduino
PMM0638.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0638.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0638.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0638.build.variant=pmm0638
PMM0638.build.variant_system_lib=
PMM0638.build.vid=0x2341
PMM0638.build.pid=0x804d
PMM0638.bootloader.tool=openocd
PMM0638.bootloader.tool.default=openocd
PMM0638.bootloader.file=zero/samd21_sam_ba.bin


# PMM0639 (Native USB Port)
# --------------------------------------
PMM0639.name=PMM0639 (Native USB Port)
PMM0639.vid.0=0x2341
PMM0639.pid.0=0x804d
PMM0639.vid.1=0x2341
PMM0639.pid.1=0x004d
PMM0639.vid.2=0x2341
PMM0639.pid.2=0x824d
PMM0639.vid.3=0x2341
PMM0639.pid.3=0x024d
PMM0639.upload_port.0.vid=0x2341
PMM0639.upload_port.0.pid=0x804d
PMM0639.upload_port.1.vid=0x2341
PMM0639.upload_port.1.pid=0x004d
PMM0639.upload_port.2.vid=0x2341
PMM0639.upload_port.2.pid=0x824d
PMM0639.upload_port.3.vid=0x2341
PMM0639.upload_port.3.pid=0x024d
PMM0639.upload_port.4.board=arduino_zero_native
PMM0639.build.usb_product="PMM0639"
PMM0639.upload.tool=bossac
PMM0639.upload.tool.default=bossac
PMM0639.upload.tool.network=arduino_ota
PMM0639.upload.protocol=sam-ba
PMM0639.upload.maximum_size=262144
PMM0639.upload.maximum_data_size=32768
PMM0639.upload.use_1200bps_touch=true
PMM0639.upload.wait_for_upload_port=true
PMM0639.upload.native_usb=true
PMM0639.build.mcu=cortex-m0plus
PMM0639.build.f_cpu=48000000L
PMM0639.build.usb_product="pmm0639"
PMM0639.build.usb_manufacturer="PMM LLC"
PMM0639.build.board=pmm0639
PMM0639.build.core=arduino
PMM0639.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0639.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0639.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0639.build.variant=pmm0639
PMM0639.build.variant_system_lib=
PMM0639.build.vid=0x2341
PMM0639.build.pid=0x804d
PMM0639.bootloader.tool=openocd
PMM0639.bootloader.tool.default=openocd
PMM0639.bootloader.file=zero/samd21_sam_ba.bin







# PMM0612 (Native USB Port)
# --------------------------------------
PMM0612.name=PMM0612 (Native USB Port)
PMM0612.vid.0=0x2341
PMM0612.pid.0=0x804d
PMM0612.vid.1=0x2341
PMM0612.pid.1=0x004d
PMM0612.vid.2=0x2341
PMM0612.pid.2=0x824d
PMM0612.vid.3=0x2341
PMM0612.pid.3=0x024d
PMM0612.upload_port.0.vid=0x2341
PMM0612.upload_port.0.pid=0x804d
PMM0612.upload_port.1.vid=0x2341
PMM0612.upload_port.1.pid=0x004d
PMM0612.upload_port.2.vid=0x2341
PMM0612.upload_port.2.pid=0x824d
PMM0612.upload_port.3.vid=0x2341
PMM0612.upload_port.3.pid=0x024d
PMM0612.upload_port.4.board=arduino_zero_native
PMM0612.build.usb_product="PMM0612"
PMM0612.upload.tool=bossac
PMM0612.upload.tool.default=bossac
PMM0612.upload.tool.network=arduino_ota
PMM0612.upload.protocol=sam-ba
PMM0612.upload.maximum_size=262144
PMM0612.upload.maximum_data_size=32768
PMM0612.upload.use_1200bps_touch=true
PMM0612.upload.wait_for_upload_port=true
PMM0612.upload.native_usb=true
PMM0612.build.mcu=cortex-m0plus
PMM0612.build.f_cpu=48000000L
PMM0612.build.usb_product="pmm0612"
PMM0612.build.usb_manufacturer="PMM LLC"
PMM0612.build.board=pmm0612
PMM0612.build.core=arduino
PMM0612.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0612.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0612.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0612.build.variant=pmm0612
PMM0612.build.variant_system_lib=
PMM0612.build.vid=0x2341
PMM0612.build.pid=0x804d
PMM0616.bootloader.tool=openocd
PMM0612.bootloader.tool.default=openocd
PMM0612.bootloader.file=zero/samd21_sam_ba.bin




